# Kin Analytics Exercise - Trosman Denis - Churn Prediction

# Import libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

# Configs
pd.options.display.float_format = '{:.2f}'.format
pd.set_option('display.max_colwidth', None)
pd.set_option('display.max_columns', None)
color_pal = sns.color_palette()
plt.style.use('fivethirtyeight')

# Read Files

### Clients

In [32]:
date_cols_clients = ['application_date','birth_date','exit_date']
df_clients = pd.read_csv('../data/clients_table.txt', parse_dates=date_cols_clients)
df_clients.head()

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date
0,15745584,EIRLS,Germany,Female,0.00,1.00,0.00,2018-12-14,NaT,1997-09-18
1,14990118,MOLOCK,Italy,Male,1.00,0.00,121219.28,2019-01-08,NaT,1980-08-03
2,14733224,PAWLUCH,Italy,Female,1.00,1.00,159663.59,2012-08-01,2013-08-09,1977-08-19
3,14648573,NALLS,Spain,Male,1.00,0.00,140827.98,2019-06-19,NaT,1979-02-27
4,15365443,EBERLE,Italy,Male,1.00,0.00,35521.28,2014-01-26,2015-12-04,1972-12-21

In [33]:
print(f'Number of rows: {df_clients.shape[0]}, Number of columns:{df_clients.shape[1]}')
print(f'\n Duplicated amount: {df_clients.duplicated().sum()}\n')
print('-'*30 + 'Number of null values' +'-'*30)
print(df_clients.isna().sum())
print('-'*30 + 'Type of variables' +'-'*30)
df_clients.dtypes

Number of rows: 1545000, Number of columns:10

 Duplicated amount: 45000

------------------------------Number of null values------------------------------
CustomerId               0
Surname              74916
Geography            58459
Gender               74886
HasCrCard            74886
IsActiveMember       74886
EstimatedSalary      74886
application_date         0
exit_date           490414
birth_date           74886
dtype: int64
------------------------------Type of variables------------------------------

CustomerId                   int64
Surname                     object
Geography                   object
Gender                      object
HasCrCard                  float64
IsActiveMember             float64
EstimatedSalary            float64
application_date    datetime64[ns]
exit_date           datetime64[ns]
birth_date          datetime64[ns]
dtype: object

### Credit score

In [34]:
df_credit_score = pd.read_csv('../data/credit_score_table.txt', parse_dates=['Date'])

In [35]:
df_credit_score.head()

   CustomerId       Date  Score
0    14759722 2018-07-01    717
1    15907276 2011-09-01    562
2    15346641 2013-01-01    604
3    15595126 2018-08-01    469
4    15227788 2013-09-01    655

In [36]:
print(f'Number of rows: {df_credit_score.shape[0]}, Number of columns:{df_credit_score.shape[1]}')
print(f'\n Duplicated amount: {df_credit_score.duplicated().sum()}\n')
print('-'*30 + 'Number of null values' +'-'*30)
print(df_credit_score.isna().sum())
print('-'*30 + 'Type of variables' +'-'*30)
df_credit_score.dtypes

Number of rows: 19500000, Number of columns:3

 Duplicated amount: 0

------------------------------Number of null values------------------------------
CustomerId    0
Date          0
Score         0
dtype: int64
------------------------------Type of variables------------------------------

CustomerId             int64
Date          datetime64[ns]
Score                  int64
dtype: object

### Products

In [14]:
df_products = pd.read_csv('../data/products_table.txt')
df_products.head()

                  ContractId  CustomerId   Products
0  5Xo9sCduOGo5EhBYhzKrSlLIA    14993808  Product B
1  3nQbqbnpTeSkYIJWT1UDe1GZ1    15560417  Product B
2  PD9KwDPOwyJWO6LJKPGBbkrCz    15406428  Product C
3  IhS7pz8lu07LCZSqYNlL0fuLP    15604313  Product B
4  ftUey4oVmkZj8RaBVFH6SNzVM    14952409  Product C

In [27]:
print(f'Number of rows: {df_products.shape[0]}, Number of columns:{df_products.shape[1]}')
print(f'\n Duplicated amount: {df_products.duplicated().sum()}\n')
print('-'*30 + 'Number of null values' +'-'*30)
print(df_products.isna().sum())
print('-'*30 + 'Type of variables' +'-'*30)
df_products.dtypes

Number of rows: 3739192, Number of columns:3

 Duplicated amount: 0

------------------------------Number of null values------------------------------
ContractId    0
CustomerId    0
Products      0
dtype: int64
------------------------------Type of variables------------------------------

ContractId    object
CustomerId     int64
Products      object
dtype: object

### Transactions

In [15]:
df_transactions = pd.read_csv('../data/transactions_table.txt')
df_transactions.head()

   CustomerId Transaction   Value
0    15653320     trans_4 -294.03
1    14955663     trans_3 1297.97
2    15218505     trans_4  191.28
3    15391934     trans_3 2299.07
4    14847291     trans_3 1612.10

In [28]:
print(f'Number of rows: {df_transactions.shape[0]}, Number of columns:{df_transactions.shape[1]}')
print(f'\n Duplicated amount: {df_transactions.duplicated().sum()}\n')
print('-'*30 + 'Number of null values' +'-'*30)
print(df_transactions.isna().sum())
print('-'*30 + 'Type of variables' +'-'*30)
df_transactions.dtypes

Number of rows: 7500000, Number of columns:3

 Duplicated amount: 0

------------------------------Number of null values------------------------------
CustomerId     0
Transaction    0
Value          0
dtype: int64
------------------------------Type of variables------------------------------

CustomerId       int64
Transaction     object
Value          float64
dtype: object

# Data cleansing

### Clients database filtering

In [41]:
df_clients.head()

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date
0,15745584,EIRLS,Germany,Female,0.00,1.00,0.00,2018-12-14,NaT,1997-09-18
1,14990118,MOLOCK,Italy,Male,1.00,0.00,121219.28,2019-01-08,NaT,1980-08-03
2,14733224,PAWLUCH,Italy,Female,1.00,1.00,159663.59,2012-08-01,2013-08-09,1977-08-19
3,14648573,NALLS,Spain,Male,1.00,0.00,140827.98,2019-06-19,NaT,1979-02-27
4,15365443,EBERLE,Italy,Male,1.00,0.00,35521.28,2014-01-26,2015-12-04,1972-12-21

In [42]:
df_clients.application_date.describe()

count                          1545000
mean     2015-09-01 16:09:33.483495680
min                2012-01-01 00:00:00
25%                2013-04-04 00:00:00
50%                2014-07-08 00:00:00
75%                2018-08-27 00:00:00
max                2019-11-30 00:00:00
Name: application_date, dtype: object

#### Get contracts from 2015 onwards

In [47]:
df_clients_f = df_clients[df_clients.application_date > '2015-01-01'].copy()

Check minimum date is 2015 onwards

In [49]:
df_clients_f.application_date.min()

Timestamp('2015-01-02 00:00:00')

This filter leaves us with 623,237 cases

In [54]:
df_clients_f.shape

(623237, 10)

#### Clean contracts with more than 75% info missing

Create temporary column to filter cases

In [75]:
df_clients_f['pct_missing'] = (df_clients_f.isna().sum(axis=1)/(df_clients.shape[1]))

In [79]:
df_clients_f = df_clients_f[df_clients_f['pct_missing']<=0.75]

This filter reduces the number of cases to 604,586

In [82]:
df_clients_f.shape

(604586, 10)

#### Delete duplicates by contract

There are 17,621 repeated clients, after the previous filters

In [93]:
df_clients_f.duplicated(subset=['CustomerId']).sum()

17621

In [98]:
df_clients_f.drop_duplicates(subset=['CustomerId'],inplace=True)

That leaves us with 586,965 cases

In [99]:
df_clients_f.shape

(586965, 10)

#### Get clients with two years of info or more

- Database has a delivery date of 30/11/2019, so that date will be taken for calculation
- Churns will be defined as those with an exit date. All cases without exit dates will be considered as not churns

In [140]:
df_clients_f.head()

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date
0,15745584,EIRLS,Germany,Female,0.00,1.00,0.00,2018-12-14,NaT,1997-09-18
1,14990118,MOLOCK,Italy,Male,1.00,0.00,121219.28,2019-01-08,NaT,1980-08-03
3,14648573,NALLS,Spain,Male,1.00,0.00,140827.98,2019-06-19,NaT,1979-02-27
5,15638124,BRASHERS,Italy,Female,0.00,0.00,170661.45,2018-02-23,NaT,1983-01-13
7,14523468,LASKOSKI,Spain,Female,1.00,0.00,158161.23,2017-12-28,2018-11-19,1972-10-30

In [141]:
(pd.to_datetime('2019/11/30') - df_clients_f.application_date).dt.days / 365

0         0.96
1         0.89
3         0.45
5         1.77
7         1.92
          ...
1544991   0.82
1544993   1.07
1544995   0.26
1544996   1.97
1544999   0.33
Name: application_date, Length: 586965, dtype: float64

In [142]:
df_clients_f['CustomerLifetime'] = (pd.to_datetime('2019/11/30') - df_clients_f.application_date).dt.days / 365

In [147]:
df_clients_f.application_date.dt.year.value_counts()

application_date
2018    289315
2019    262955
2017     27834
2016      3438
2015      3423
Name: count, dtype: int64

In [149]:
df_clients_f[df_clients_f['CustomerLifetime']>=2].exit_date.isna().sum()

2817

In [128]:
two_years_after_application = df_clients_f['application_date'] + pd.DateOffset(years=2)

In [139]:
(df_clients_f['application_date'] > two_years_after_application).astype(int)

0          0
1          0
3          0
5          0
7          0
          ..
1544991    0
1544993    0
1544995    0
1544996    0
1544999    0
Name: application_date, Length: 586965, dtype: int32

In [133]:
df_clients_f['churn'] = ((df_clients_f['exit_date'] <= two_years_after_application) | (df_clients_f['application_date'] > two_years_after_application)).astype(int)

In [134]:
df_clients_f.churn.describe()

count   586965.00
mean         0.21
std          0.41
min          0.00
25%          0.00
50%          0.00
75%          0.00
max          1.00
Name: churn, dtype: float64

In [127]:
df_clients_f[df_clients_f.CustomerLifetime >= 2]

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date,CustomerLifetime
75,15610711,Eluemuno,Germany,Female,0.00,0.00,167673.37,2017-03-05,2019-11-27,1976-10-21,2.74
198,15764170,Pinto,Germany,Male,1.00,0.00,36579.53,2017-02-05,2018-10-11,1972-04-02,2.82
484,15594720,Scott,Germany,Female,1.00,1.00,189339.60,2017-11-08,NaT,1982-05-14,2.06
901,15706552,Odinakachukwu,France,Male,0.00,1.00,156731.91,2016-02-15,2019-10-02,1979-09-09,3.79
1255,15785358,Gresswell,Germany,Male,1.00,1.00,79366.98,2016-09-17,2016-12-20,1969-11-11,3.20
...,...,...,...,...,...,...,...,...,...,...,...
1543548,15689152,Loggia,Spain,Male,0.00,0.00,15378.75,2016-04-14,2019-08-07,1978-02-21,3.63
1543594,15787204,Howe,Spain,Female,0.00,0.00,108804.28,2017-08-30,2019-10-02,1974-07-09,2.25
1543930,15606887,Singh,France,Female,1.00,0.00,193880.60,2017-02-04,2018-06-30,1987-01-12,2.82
1544413,15778320,Teng,Germany,Female,0.00,0.00,158853.98,2016-10-11,NaT,1976-08-20,3.14
1544814,15601172,Nelson,France,Male,1.00,0.00,177295.92,2016-01-12,2018-03-01,1984-02-07,3.88

In [121]:
df_clients_f.IsActiveMember.value_counts()

IsActiveMember
0.00    288042
1.00    287915
Name: count, dtype: int64

In [119]:
df_clients_f.exit_date.isna().sum()

458085

**Further analysis on clients activity**

There are cases where client is no longer active but there is no exit date (226,330)

In [109]:
df_clients_f[(df_clients_f.IsActiveMember == 0)&(df_clients_f.exit_date.isna())]

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date
1,14990118,MOLOCK,Italy,Male,1.00,0.00,121219.28,2019-01-08,NaT,1980-08-03
3,14648573,NALLS,Spain,Male,1.00,0.00,140827.98,2019-06-19,NaT,1979-02-27
5,15638124,BRASHERS,Italy,Female,0.00,0.00,170661.45,2018-02-23,NaT,1983-01-13
18,15613805,KALATHAS,France,Male,0.00,0.00,47278.31,2019-02-19,NaT,1990-04-03
24,15434700,STIMMELL,Germany,Male,1.00,0.00,138615.32,2018-06-06,NaT,1994-07-22
...,...,...,...,...,...,...,...,...,...,...
1544976,14543676,ABRIAL,France,Male,0.00,0.00,150110.76,2019-01-27,NaT,1979-10-08
1544977,15289671,YOUN,Germany,Male,0.00,0.00,98424.55,2019-01-23,NaT,1977-04-05
1544993,15931559,TILOTTA,Germany,Female,1.00,0.00,132091.54,2018-11-06,NaT,1964-08-27
1544995,14878861,LEVENSTEIN,Italy,Female,0.00,0.00,99110.94,2019-08-26,NaT,1990-05-19
1544999,15858637,MANUAL,Spain,Female,0.00,0.00,39908.14,2019-08-03,NaT,1987-02-16

Cases with exit_dates and active members should be discarded, as it shows inconsistency (61,276)

In [106]:
df_clients_f[(df_clients_f.IsActiveMember == 1)&~(df_clients_f.exit_date.isna())]

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date
14,15165393,LABIANCA,Spain,Male,1.00,1.00,2612.65,2018-02-22,2019-06-11,1974-07-11
20,15982728,GOUDEAU,France,Male,0.00,1.00,66465.09,2018-02-02,2019-06-01,1972-12-18
69,15398020,VANDERVEER,Spain,Female,0.00,1.00,96945.16,2018-03-02,2019-03-03,1977-04-13
112,15325976,ARQUETTE,France,Male,1.00,1.00,34591.80,2019-03-15,2019-07-20,1974-01-05
190,14769148,CUCVAS,Italy,Male,0.00,1.00,124916.39,2018-01-22,2019-08-01,1965-08-13
...,...,...,...,...,...,...,...,...,...,...
1544876,15889530,MALLY,France,Male,0.00,1.00,127059.77,2018-11-03,2019-04-03,1940-08-31
1544911,14548475,DININNO,France,Male,0.00,1.00,171019.45,2018-06-20,2018-09-24,1987-10-03
1544922,15392190,WALKINGTON,Italy,Male,0.00,1.00,39010.53,2018-09-14,2019-10-24,1999-04-19
1544958,14625983,SURMA,Italy,Female,0.00,1.00,85375.86,2018-01-17,2018-07-10,1959-03-22
1544967,15020884,ASHTON,France,Female,1.00,1.00,212893.80,2018-03-31,2018-10-12,1983-02-28

#### Italy cases

In [52]:
df_clients_f.Geography.value_counts()

Geography
France     156426
Germany    154201
Spain      153443
Italy      135818
Name: count, dtype: int64

In [89]:
df_clients_f[df_clients_f.Geography=='Italy'].application_date.describe()

count                           135818
mean     2018-11-30 20:13:14.121544704
min                2017-12-01 00:00:00
25%                2018-06-01 00:00:00
50%                2018-12-02 00:00:00
75%                2019-06-01 00:00:00
max                2019-11-30 00:00:00
Name: application_date, dtype: object

## Feature engineering

### Products

Calculate amount of products by customer

In [100]:
df_products.head()

                  ContractId  CustomerId   Products
0  5Xo9sCduOGo5EhBYhzKrSlLIA    14993808  Product B
1  3nQbqbnpTeSkYIJWT1UDe1GZ1    15560417  Product B
2  PD9KwDPOwyJWO6LJKPGBbkrCz    15406428  Product C
3  IhS7pz8lu07LCZSqYNlL0fuLP    15604313  Product B
4  ftUey4oVmkZj8RaBVFH6SNzVM    14952409  Product C

In [166]:
df_products_number = df_products.groupby('CustomerId').agg(number_of_products = ('Products','count')).reset_index()

In [167]:
df_products_number.head()

   CustomerId  number_of_products
0    14500000                   4
1    14500001                   2
2    14500002                   2
3    14500003                   3
4    14500004                   3

### Transactions

Create balance variable

In [154]:
df_transactions.head()

   CustomerId Transaction   Value
0    15653320     trans_4 -294.03
1    14955663     trans_3 1297.97
2    15218505     trans_4  191.28
3    15391934     trans_3 2299.07
4    14847291     trans_3 1612.10

In [160]:
df_transact_pivoted = df_transactions.pivot(index='CustomerId',columns='Transaction',values='Value').reset_index()

In [161]:
df_transact_pivoted['balance'] = df_transact_pivoted[['trans_1','trans_2','trans_3','trans_4','trans_5']].sum(axis=1)

In [165]:
df_transact_pivoted.head()

Transaction,CustomerId,trans_1,trans_2,trans_3,trans_4,trans_5,balance
0,14500000,1456.63,-317.81,1047.96,-249.61,-1937.17,0.00
1,14500001,2717.35,-149.95,2560.88,-94.99,46372.32,51405.61
2,14500002,3470.33,-868.05,1229.14,-120.02,117052.10,120763.50
3,14500003,4711.95,-224.06,1576.25,313.71,143518.86,149896.71
4,14500004,3959.83,-632.33,2802.98,-804.26,137735.31,143061.53

### Credit scores

In [186]:
df_credit_score.head()

   CustomerId       Date  Score
0    14759722 2018-07-01    717
1    15907276 2011-09-01    562
2    15346641 2013-01-01    604
3    15595126 2018-08-01    469
4    15227788 2013-09-01    655

13 values for customers

In [188]:
df_credit_score.groupby('CustomerId').count().head()

            Date  Score
CustomerId
14500000      13     13
14500001      13     13
14500002      13     13
14500003      13     13
14500004      13     13

Given that in this table the dates are beginning of month, and on the client's table they are specific dates, we can join them by year-month combinations.

Create year and month variable

In [189]:
df_credit_score['Date'] = pd.to_datetime(df_credit_score['Date'])
df_clients['application_date'] = pd.to_datetime(df_clients['application_date'])

In [208]:
# Credit table
df_credit_score['year'] = df_credit_score.Date.dt.year
df_credit_score['month'] = df_credit_score.Date.dt.month

# Client's table
df_clients['year'] = df_clients.application_date.dt.year
df_clients['month'] = df_clients.application_date.dt.month

Merge them

In [214]:
df_clients = df_clients.merge(df_credit_score, how='left',on=['CustomerId','year','month'])

In [215]:
df_clients.sample(5)

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date,age,year,month,Date,Score
140032,15699011,MOOTRY,Italy,Female,1.00,1.00,79115.57,2012-06-15,2013-02-14,1993-07-16,26.00,2012,6,2012-06-01,607
617177,15568853,BRUNETTI,Germany,Male,1.00,1.00,86509.48,2014-01-04,2015-08-13,1968-06-08,51.00,2014,1,2014-01-01,649
1423764,15194912,JAARDA,Italy,Female,0.00,0.00,149427.19,2019-07-09,NaT,1978-04-09,41.00,2019,7,2019-07-01,575
60176,14912753,NaN,NaN,NaN,NaN,NaN,NaN,2012-03-12,2014-12-28,NaT,NaN,2012,3,2012-03-01,587
81625,14598774,WHITESEL,Germany,Female,1.00,0.00,125741.86,2012-04-07,2014-12-17,1977-04-26,42.00,2012,4,2012-04-01,625

Drop unnecessary columns

In [217]:
df_clients.drop(columns=['year','month','Date'],inplace=True)

### Clients

Calculate Age

In [181]:
def calculate_age(born, cut_date):
    return cut_date.year - born.year - ((cut_date.month, cut_date.day) < (born.month, born.day))

In [182]:
df_clients['birth_date'] = pd.to_datetime(df_clients['birth_date'])

In [183]:
cut_date = pd.to_datetime('2019-11-30')

In [184]:
df_clients['age'] = df_clients['birth_date'].apply(calculate_age, cut_date=cut_date)

### Final merge

In [219]:
df_clients = (df_clients
                        .merge(df_products_number,how='left',on='CustomerId')
                        .merge(df_transact_pivoted[['CustomerId','balance']],how='left',on='CustomerId')
                        )

In [220]:
df_clients.head()

,CustomerId,Surname,Geography,Gender,HasCrCard,IsActiveMember,EstimatedSalary,application_date,exit_date,birth_date,age,Score,number_of_products,balance
0,15870853,SAICE,France,Female,1.00,1.00,54048.74,2012-01-01,2013-03-19,1980-08-11,39.00,668,4,30284.13
1,15840520,WEICK,Germany,Male,1.00,1.00,160935.54,2012-01-01,2013-08-29,1940-10-02,79.00,808,2,102525.56
2,15475971,KIRSCHNER,France,Male,0.00,0.00,79622.75,2012-01-01,2014-11-21,1971-11-25,48.00,716,2,104414.95
3,15137764,GALLANDER,Spain,Male,1.00,0.00,54108.77,2012-01-01,2015-12-14,1983-08-04,36.00,588,4,50326.85
4,14614809,STOFSKY,Italy,Male,1.00,0.00,213104.92,2012-01-01,2015-02-07,1974-06-15,45.00,733,3,65715.27

## EDA